//*****ICM *****Week 2 Assignment
//Created by CHENSHAN GAO on 2018/09/17
//Create a sketch that includes (all of these):
// One element controlled by the mouse.
// One element that changes over time, independently of the mouse.
// One element that is different every time you run the sketch.

var 白色 = 255;
var 眉毛颜色 = '#CB6064'
var 体色 = 0;
var 脸色 = 白色;

var 眉毛 = ["左上", "左下", "右上", "右下"];
var 眉毛起始点 = {
  "左上": [317, 446],
  "左下": [316, 481],
  "右上": [388, 417],
  "右下": [395, 473]
};
var 眉毛各点位移 = {
  "左上": [[0, 0], [-8, -15], [0, -14], [-12, 4], [-5, 8], [-2, 21]],
  "左下": [[0, 0], [-6, 0], [-19, 6], [11, 27], [14, 19], [6, -3], [-4, -32]],
  "右上": [[0, 0], [8, -7], [13, 17], [-1, 11], [-16, 6], [-2, -10]],
  "右下": [[0, 0], [10, 46], [3, 12], [8, -25], [2, -14], [0, -21]]
}

var 手臂起始点 = [302, 701]
var 手臂各点位移 = [[0, 0], [-92, 55], [-26, -5], [-15, -25], [-11, -30], [-3, -55], [7, -42],
  [-10, -9], [2, -12], [13, -11], [14, -2], [10, 9], [0, 19], [0, 29], [4, 28], [16, 15], [74, -40]]

var 身体起始点 = [345, 317]
var 身体各点位移 = [[0, 0], [-45, 12], [-43, 33], [-24, 45], [-8, 44], [2, 68], [-4, 90],
  [-11, 145], [-30, 81], [363, 2], [-31, -309], [-22, -118], [-45, -66], [-57, -26]]

function 构图() {
  新画布(600, 800);
}

function 绘制() {
  背景色(白色);
  画包络线(体色, 身体起始点, 身体各点位移);
  填色椭圆(脸色, {x: 360, y: 500, 宽: 200, 高: 270})
  for (i in 眉毛) {
    画包络线(眉毛颜色, 眉毛起始点[眉毛[i]], 眉毛各点位移[眉毛[i]]);
  }
  // 左右眼
  填色椭圆(体色, {x: 300, y: 465, 宽: 20 + mouseX / 26, 高: 20})
  填色椭圆(体色, {x: 403, y: 458, 宽: 20 + mouseX / 26, 高: 20})

  嘴()
  手臂()
  手指()
}

function 填色椭圆(颜色, 参数) {
  无边界()
  填纯色(颜色);
  椭圆(参数.x, 参数.y, 参数.宽, 参数.高)
}

function 画包络线(颜色, 起始点, 各点位移) {
  无边界()
  填纯色(颜色);
  var 当前点 = 起始点;
  beginShape()
  for (序号 in 各点位移) {
    位移 = 各点位移[序号]
    当前点 = [当前点[0] + 位移[0], 当前点[1] + 位移[1]];
    按点连曲线(当前点[0], 当前点[1]);
  }
  endShape(CLOSE)
}

function 嘴() {
  笔宽(13);
  笔色(体色);
  不填充();
  画弧(360, 580, 50, 15, 0.2, 3, OPEN);
  笔宽(3);
  画弧(360, 600, 40, 10, 0.2, 3, OPEN);
}

function 手臂() {
  旋转(mouseX / 18000)
  画包络线(体色, 手臂起始点, 手臂各点位移);
}

function 手指() {
  填色椭圆(体色, {x: 170, y: 560, 宽: mouseX / 64, 高: mouseX / 21})
}
