var 白色 = 255;

// 最多只能15s, 详见https://p5js.org/reference/#/p5/saveFrames
var 截取帧秒数 = 15;
var 截取帧速 = 10;

var 初始偏移 = -100;
var 初始距离 = 200;

// 眼睛方向
var 左 = {x: -1, y: 0};
var 右 = {x: 1, y: 0};
var 上 = {x: 0, y: -1};
var 下 = {x: 0, y: 1};
var 所有眼睛方向 = [左, 上, 右, 下];
var 左右 = [左, 右];

function setup() {
  createCanvas(1000,500);

  //保存帧("人脸_", "png", 截取帧秒数, 截取帧速);
}

/*
小春: hurry up, hurry up, don't look(拉开距离)
小春: 哎! Hurry up! hurry up~
jasper: I know. What's wrong with you?
小春: huh? What's wrong with you? hurry up
jasper: umm can you stop angry now?
小春: sorry?
jasper: I say (喇叭) can you stop angry now?
小春: ok, sorry, sorry 
*/
function draw() {
  背景色(白色);
  var 帧号 = 帧序号();
  var 对话距离 = 100;
  var 小春0 = 400;
  var 小春1 = 小春0 + 对话距离;
  var 小春2 = 小春1 + 对话距离;
  var 小春3 = 小春2 + 对话距离;
  if (帧号 < 小春0) {
    画脸(所有眼睛方向[Math.ceil(帧号 / 50) % 4], true,  帧号/ 2, "", "");
    画脸(下, false, 帧号 + 初始距离, "Hurry up. Hurry up!", "Don't look!");
  } else if (帧号 > 小春0 && 帧号 < 小春1) {
    var 前半 = 帧号 < 小春0 + 对话距离/2;
    画脸(上, true,  帧号/ 2, 前半 ? "" : "I know", 前半 ? "" : "What's wrong with you?");
    画脸(下, false, 小春0 + 初始距离, 前半 ? "哎!" : "", 前半 ? "Hurry up!" : "");
  } else if (帧号 > 小春1 && 帧号 <小春2) {
    var 前半 = 帧号 < 小春1 + 对话距离/2;
    画脸(上, true,  小春1/ 2, 前半 ? "" : "Can you stop", 前半 ? "" : "angry now?");
    画脸(下, false, 小春0 + 初始距离, 前半 ? "huh? What's wrong with you?" : "", 前半 ? "Hurry up~" : "");
  } else if (帧号 > 小春2 && 帧号 <小春3) {
    var 前半 = 帧号 < 小春2 + 对话距离/2;
    画脸(上, true,  小春1/ 2, 前半 ? "" : "I say...CAN YOU", 前半 ? "" : "STOP ANGRY NOW?");
    画脸(下, false, 小春0 + 初始距离, 前半 ? "Sorry??" : "", 前半 ? "" : "");
  } else if (帧号 > 小春3){
    画脸(右, true,  小春1/ 2 + (帧号 - 小春3)/2, "", "");
    画脸(左, false, 小春0 + (帧号 - 小春3)/2 + 初始距离, "...OK", "Sorry.");
  }

}

// 小孩: true 则额头大, 脸小
function 画脸(眼睛方向, 小孩, 附加x偏移, 行1, 行2) {
  var x偏移 = 初始偏移 + 附加x偏移;
  var y偏移 = 小孩 ? 100 : 0;
  
  var 比例 = 小孩 ? 0.8 : 1;
  var 额头位移 = 小孩 ? 0 : 20;
  // 脸
  var c = color(255,235,205);
  填色(c);
  无边界();
  椭圆(250 + x偏移, 250 + y偏移, 270 * 比例, 360 * 比例);

  // 宽额头(头部)
  长方形(115 + x偏移, 150 + y偏移, 270, 80);

  // 头发
  fill(0);
  无边界();	
  arc(250 + x偏移, 150 + 额头位移 + y偏移, 270, 240,PI,0,CHORD);

  // 前额
  填色(255,235,205);
  arc(250 + x偏移, 150 + 额头位移 + y偏移, 270, 170,PI,0,CHORD);

  // 鼻子
  不填充();
  笔宽(3);
  stroke(82,63,35);
  beginShape();
  curveVertex(250 + x偏移, 250 + y偏移);
  curveVertex(250 + x偏移, 250 + y偏移);
  curveVertex(230 + x偏移, 290 + y偏移);
  curveVertex(230 + x偏移, 300 + y偏移);
  curveVertex(260 + x偏移, 305 + y偏移);
  curveVertex(260 + x偏移, 320 + y偏移);
  endShape();

  var 五官位移 = 小孩 ? 10 : 0;

  // 双眼
  var 眼睛位移 = {x: 20 * 眼睛方向.x, y: 5 * 眼睛方向.y};
  for (var i = 0; i < 左右.length; i++ ) {
    var 位置 = 左右[i].x;

    // 耳
    填色(c);
    无边界();
    椭圆(250 + 130 * 位置 + x偏移, 230 + 额头位移 * 2 + y偏移, 60,80);

    // 眉
    填色(78,61,54);
    无边界();
    quad(250 + 105 * 位置 + x偏移, 205 + y偏移, 250 + 75 * 位置 + x偏移, 185 + y偏移, 250 + 75 * 位置 + x偏移, 200 + y偏移, 250 + 105 * 位置 + x偏移, 208 + y偏移);
    长方形(227 + 53 * 位置 + x偏移, 185 + y偏移, 45, 15);

    // 睫毛
    不填充();
    笔宽(2);
    stroke(74,44,0);
    curve(250 + 90 * 位置 + x偏移, 230 + y偏移, 250 + 90 * 位置 + x偏移, 240 + y偏移, 250 + 100 * 位置+ x偏移, 220 + y偏移, 250 + 80 * 位置 + x偏移, 200 + y偏移);
    curve(250 + 80 * 位置 + x偏移, 230 + y偏移, 250 + 80 * 位置 + x偏移, 240 + y偏移, 250 + 90 * 位置+ x偏移, 220 + y偏移, 250 + 70 * 位置 + x偏移, 200 + y偏移);

    填色(255,249,250);
    笔宽(2);
    stroke(82,63,35);
    椭圆(250 + 70 * 位置 + x偏移,240 + 五官位移 + y偏移,60,25);
    填色(74,44,0);
    无边界();
    椭圆(250 + 70 * 位置 + x偏移 + 眼睛位移.x, 240 + 眼睛位移.y + 五官位移 + y偏移, 22,22);
    填色(0);
    无边界();
    椭圆(250 + 70 * 位置 + x偏移 + 眼睛位移.x, 240 + 眼睛位移.y + 五官位移 + y偏移, 15,15);
    填色(255,249,250);
    无边界();
    椭圆(245 + 70 * 位置 + x偏移 + 眼睛位移.x, 240 + 眼睛位移.y + 五官位移 + y偏移, 5,5);
  }

  // 嘴唇
  填色(200,80,80);
  无边界();
  arc(235 + x偏移,360 - 五官位移 + y偏移,50 * 比例,25 * 比例,PI,0,CHORD);
  arc(265 + x偏移,360 - 五官位移 + y偏移,50 * 比例,25 * 比例,PI,0,CHORD);
  arc(250 + x偏移,365 - 五官位移 + y偏移,80 * 比例,30 * 比例,0,PI,CHORD);
  
  对话框(x偏移, 行1, 行2);
}

function 对话框(x偏移, 行1, 行2) {
  填色(250,250,250);
  无边界();
  椭圆(10 + x偏移,10,200,200);
  triangle(100 + x偏移,100,70 + x偏移,70,50 + x偏移,100);
  //textbubble

  填色(0,102,153);
  textSize(20);
  text(行1,5 + x偏移,30);
  textSize(20);
  text(行2,20 + x偏移,60);
  //text
}